Ran Plan for project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "custom" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + description            = "Service Discovery - internal VPC communication"
      + from_port              = 8080
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-02997a2675e266a40"
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod-custom-ingress-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + to_port                = 8080
    }

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-web-api-prod"
        name                               = "crawlinghub-web-api-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for crawlinghub-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:75" -> (known after apply)
        # (16 unchanged attributes hidden)

      + service_registries {
          + registry_arn = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:75" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-web-api-prod" -> (known after apply)
      ~ revision                 = 75 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for crawlinghub-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-web-api"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs_service.aws_service_discovery_service.this[0] will be created
+ resource "aws_service_discovery_service" "this" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "crawlinghub-web-api-prod"
      + namespace_id  = (known after apply)
      + tags          = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Cloud Map service for crawlinghub-web-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all      = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Cloud Map service for crawlinghub-web-api-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-prod-service-discovery"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (sensitive value)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:75" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-web-api-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-web-api%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-web-api-prod
  ```
Plan: 3 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```